Revit 2024 API
XYZ Constructor
Creates a default XYZ with the values (0, 0, 0).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public XYZ()
Visual Basic
Public Sub New
Visual C++
public:
XYZ()
See Also
XYZ Class
XYZ Overload
Autodesk.Revit.DB Namespace